mdbsliguo/stm32_template_SPL/Examples/Flash/Flash12_LittleFS_ComprehensiveTest/main_example.c
/**
 * @file main_example.c
 * @brief Flash12 - LittleFS文件系统综合测试案例
 * @details 演示LittleFS文件系统在W25Q SPI Flash上的完整功能测试
 * 
 * 硬件连接：
 * - W25Q SPI Flash模块连接到SPI2
 *   - CS：PA11
 *   - SCK：PB13（SPI2_SCK）
 *   - MISO：PB14（SPI2_MISO）
 *   - MOSI：PB15（SPI2_MOSI）
 *   - VCC：3.3V
 *   - GND：GND
 * - OLED显示屏（用于显示关键信息）
 *   - SCL：PB8
 *   - SDA：PB9
 * - UART1（用于详细日志输出）
 *   - TX：PA9
 *   - RX：PA10
 * - LED1：PA1（系统状态指示）
 * 
 * 功能演示：
 * 1. 系统初始化
 * 2. UART、Debug、Log初始化
 * 3. LED初始化
 * 4. 软件I2C初始化
 * 5. OLED初始化
 * 6. SPI初始化
 * 7. W25Q初始化与设备识别
 * 8. LittleFS文件系统初始化、挂载
 * 9. 11个综合功能测试
 * 10. 主循环（LED闪烁，OLED显示状态）
 */

#include "stm32f10x.h"
#include "system_init.h"
#include "led.h"
#include "delay.h"
#include "oled_ssd1306.h"
#include "i2c_sw.h"
#include "uart.h"
#include "debug.h"
#include "log.h"
#include "error_handler.h"
#include "spi_hw.h"
#include "w25q_spi.h"
#include "littlefs_wrapper.h"
#include "fs_wrapper.h"
#include "gpio.h"
#include "config.h"
#include "board.h"
#include "flash12_tests.h"
#include <stdint.h>
#include <stdio.h>
#include <string.h>

/* ==================== 主函数 ==================== */

/**
 * @brief 主函数
 */
int main(void)
{
    SPI_Status_t spi_status;
    W25Q_Status_t w25q_status;
    SoftI2C_Status_t i2c_status;
    UART_Status_t uart_status;
    OLED_Status_t oled_status;
    Log_Status_t log_status;
    int debug_status;
    log_config_t log_config;
    uint32_t loop_count = 0;
    
    /* ========== 步骤1：系统初始化 ========== */
    System_Init();
    
    /* ========== 步骤2：UART初始化 ========== */
    uart_status = UART_Init(UART_INSTANCE_1);
    if (uart_status != UART_OK)
    {
        while(1) { Delay_ms(1000); }
    }
    Delay_ms(100);
    
    /* ========== 步骤3：Debug模块初始化 ========== */
    debug_status = Debug_Init(DEBUG_MODE_UART, 115200);
    if (debug_status != 0)
    {
        while(1) { Delay_ms(1000); }
    }
    Delay_ms(100);
    
    /* ========== 步骤4：Log模块初始化 ========== */
    memset(&log_config, 0, sizeof(log_config));
    log_config.level = LOG_LEVEL_INFO;
    log_config.enable_timestamp = 0;
    log_config.enable_module = 1;
    log_config.enable_color = 0;
    log_status = Log_Init(&log_config);
    if (log_status != LOG_OK)
    {
        ErrorHandler_Handle(log_status, "LOG");
    }
    
    /* ========== 步骤5：输出初始化信息 ========== */
    LOG_INFO("MAIN", "=== Flash12 - LittleFS文件系统综合测试案例 ===");
    LOG_INFO("MAIN", "UART1 已初始化: PA9(TX), PA10(RX), 115200");
    LOG_INFO("MAIN", "Debug 模块已初始化: UART 模式");
    LOG_INFO("MAIN", "Log 模块已初始化");
    
    /* ========== 步骤6：LED初始化 ========== */
    if (LED_Init() != LED_OK)
    {
        LOG_ERROR("MAIN", "LED 初始化失败");
        while(1) { Delay_ms(1000); }
    }
    
    /* ========== 步骤7：软件I2C初始化（OLED需要） ========== */
    i2c_status = I2C_SW_Init(SOFT_I2C_INSTANCE_1);
    if (i2c_status != SOFT_I2C_OK)
    {
        LOG_ERROR("MAIN", "软件I2C 初始化失败: %d", i2c_status);
        ErrorHandler_Handle(i2c_status, "SOFT_I2C");
    }
    else
    {
        LOG_INFO("MAIN", "软件I2C 已初始化: PB8(SCL), PB9(SDA)");
    }
    
    /* ========== 步骤8：OLED初始化 ========== */
    oled_status = OLED_Init();
    if (oled_status != OLED_OK)
    {
        LOG_ERROR("MAIN", "OLED 初始化失败: %d", oled_status);
        ErrorHandler_Handle(oled_status, "OLED");
    }
    else
    {
        OLED_Clear();
        OLED_ShowString(1, 1, "Flash12");
        OLED_ShowString(2, 1, "Initializing...");
        LOG_INFO("MAIN", "OLED 已初始化");
    }
    
    Delay_ms(500);
    
    /* ========== 步骤9：SPI初始化 ========== */
    OLED_ShowString(3, 1, "Init SPI2...");
    
    /* 配置SPI2 NSS引脚为GPIO输出（软件NSS模式，SPI驱动不会自动配置） */
    /* 使用board.h中定义的宏，避免硬编码 */
    GPIO_EnableClock(SPI2_NSS_PORT);
    GPIO_Config(SPI2_NSS_PORT, SPI2_NSS_PIN, GPIO_MODE_OUTPUT_PP, GPIO_SPEED_50MHz);
    GPIO_WritePin(SPI2_NSS_PORT, SPI2_NSS_PIN, Bit_SET);  /* NSS默认拉高（不选中） */
    
    spi_status = SPI_HW_Init(SPI_INSTANCE_2);
    if (spi_status != SPI_OK)
    {
        char err_buf[17];
        snprintf(err_buf, sizeof(err_buf), "SPI Fail:%d", spi_status);
        OLED_ShowString(4, 1, err_buf);
        LOG_ERROR("MAIN", "SPI 初始化失败: %d", spi_status);
        ErrorHandler_Handle(spi_status, "SPI");
        Delay_ms(3000);
        while(1) { Delay_ms(1000); }
    }
    LOG_INFO("MAIN", "SPI2 已初始化: PB13(SCK), PB14(MISO), PB15(MOSI), PA11(CS)");
    
    /* ========== 步骤10：W25Q初始化 ========== */
    OLED_ShowString(3, 1, "Init W25Q...");
    w25q_status = W25Q_Init();
    if (w25q_status != W25Q_OK)
    {
        OLED_ShowString(4, 1, "W25Q Init Fail!");
        LOG_ERROR("MAIN", "W25Q 初始化失败: %d", w25q_status);
        ErrorHandler_Handle(w25q_status, "W25Q");
        while(1) { Delay_ms(1000); }
    }
    LOG_INFO("MAIN", "W25Q 初始化成功");
    
    /* 显示W25Q信息 */
    const w25q_dev_t* dev_info = W25Q_GetInfo();
    if (dev_info != NULL) {
        char buf[17];
        snprintf(buf, sizeof(buf), "Size:%d MB", dev_info->capacity_mb);
        OLED_ShowString(4, 1, buf);
        
        LOG_INFO("MAIN", "W25Q信息:");
        LOG_INFO("MAIN", "  容量: %d MB", dev_info->capacity_mb);
        LOG_INFO("MAIN", "  地址字节数: %d", dev_info->addr_bytes);
        LOG_INFO("MAIN", "  4字节模式: %s", dev_info->is_4byte_mode ? "是" : "否");
    }
    
    Delay_ms(1000);
    
    /* ========== 步骤11：LittleFS初始化 ========== */
    OLED_ShowString(3, 1, "Init LittleFS...");
    LittleFS_Status_t littlefs_status = LittleFS_Init();
    if (littlefs_status != LITTLEFS_OK)
    {
        OLED_ShowString(4, 1, "LittleFS Init Fail!");
        LOG_ERROR("MAIN", "LittleFS 初始化失败: %d", littlefs_status);
        ErrorHandler_Handle(littlefs_status, "LittleFS");
        while(1) { Delay_ms(1000); }
    }
    LOG_INFO("MAIN", "LittleFS 初始化成功");
    OLED_ShowString(4, 1, "LittleFS Ready");
    Delay_ms(500);
    
    /* ========== 步骤12：挂载前确保CS引脚配置正确 ========== */
    /* 确保SPI2 NSS引脚（CS）配置为推挽输出并拉高 */
    /* 使用GPIO模块API，避免直接操作寄存器（符合规范） */
    LOG_INFO("MAIN", "挂载前确保CS引脚配置正确...");
    
    /* 确保GPIO时钟已使能 */
    GPIO_EnableClock(SPI2_NSS_PORT);
    
    /* 确保CS引脚配置为推挽输出 */
    GPIO_Config(SPI2_NSS_PORT, SPI2_NSS_PIN, GPIO_MODE_OUTPUT_PP, GPIO_SPEED_50MHz);
    
    /* 确保CS引脚为高（释放状态） */
    GPIO_WritePin(SPI2_NSS_PORT, SPI2_NSS_PIN, Bit_SET);
    
    LOG_INFO("MAIN", "CS引脚已配置为推挽输出并拉高");
    Delay_ms(500);
    
    /* ========== 步骤13：挂载LittleFS文件系统 ========== */
    OLED_ShowString(3, 1, "Mount LittleFS...");
    
    /* 如果配置了强制格式化，先格式化 */
    #ifdef CONFIG_LITTLEFS_FORCE_FORMAT
    #if CONFIG_LITTLEFS_FORCE_FORMAT
    LOG_INFO("MAIN", "强制格式化模式：先格式化文件系统...");
    OLED_ShowString(4, 1, "Formatting...");
    littlefs_status = LittleFS_Format();
    if (littlefs_status != LITTLEFS_OK)
    {
        LOG_ERROR("MAIN", "格式化失败: %d", littlefs_status);
        ErrorHandler_Handle(littlefs_status, "LittleFS");
        OLED_ShowString(4, 1, "Format Fail!");
        while(1) { Delay_ms(1000); }
    }
    LOG_INFO("MAIN", "格式化成功");
    Delay_ms(500);
    #endif
    #endif
    
    /* 尝试挂载 */
    littlefs_status = LittleFS_Mount();
    if (littlefs_status != LITTLEFS_OK)
    {
        /* 挂载失败，尝试格式化（可能是损坏或NOSPC错误） */
        if (littlefs_status == LITTLEFS_ERROR_CORRUPT || littlefs_status == LITTLEFS_ERROR_NOSPC)
        {
            LOG_WARN("MAIN", "文件系统挂载失败 (错误: %d)，尝试格式化...", littlefs_status);
            OLED_ShowString(4, 1, "Formatting...");
            littlefs_status = LittleFS_Format();
            if (littlefs_status == LITTLEFS_OK)
            {
                LOG_INFO("MAIN", "格式化成功，重新挂载...");
                littlefs_status = LittleFS_Mount();
            }
            else
            {
                LOG_ERROR("MAIN", "格式化失败: %d", littlefs_status);
                ErrorHandler_Handle(littlefs_status, "LittleFS");
            }
        }
        
        if (littlefs_status != LITTLEFS_OK)
        {
            OLED_ShowString(4, 1, "Mount Fail!");
            LOG_ERROR("MAIN", "LittleFS 挂载失败: %d", littlefs_status);
            ErrorHandler_Handle(littlefs_status, "LittleFS");
            while(1) { Delay_ms(1000); }
        }
    }
    LOG_INFO("MAIN", "LittleFS 挂载成功");
    OLED_ShowString(4, 1, "Mounted OK");
    Delay_ms(500);
    
    /* ========== 步骤14：底层Flash硬件测试 ========== */
    LOG_INFO("MAIN", "=== 底层Flash硬件测试 ===");
    
    /* 先测试底层W25Q Flash是否正常 */
    LOG_INFO("MAIN", "=== 底层Flash硬件测试 ===");
    {
        W25Q_Status_t w25q_status;
        uint8_t test_write[16] = {0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08,
                                  0x09, 0x0A, 0x0B, 0x0C, 0x0D, 0x0E, 0x0F, 0x10};
        uint8_t test_read[16] = {0};
        
        /* 擦除扇区0（用于测试） */
        LOG_INFO("MAIN", "擦除扇区0（测试地址）...");
        w25q_status = W25Q_EraseSector(0x10000);  /* 使用16KB地址，避免与LittleFS冲突 */
        if (w25q_status == W25Q_OK)
        {
            W25Q_WaitReady(0);
            LOG_INFO("MAIN", "扇区擦除成功");
            
            /* 写入测试数据 */
            LOG_INFO("MAIN", "写入16字节测试数据...");
            w25q_status = W25Q_Write(0x10000, test_write, sizeof(test_write));
            if (w25q_status == W25Q_OK)
            {
                W25Q_WaitReady(0);
                LOG_INFO("MAIN", "数据写入成功");
                
                /* 读取并验证 */
                Delay_ms(10);
                w25q_status = W25Q_Read(0x10000, test_read, sizeof(test_read));
                if (w25q_status == W25Q_OK)
                {
                    if (memcmp(test_write, test_read, sizeof(test_write)) == 0)
                    {
                        LOG_INFO("MAIN", "底层Flash硬件测试通过");
                    }
                    else
                    {
                        LOG_ERROR("MAIN", "底层Flash数据验证失败！");
                        LOG_ERROR("MAIN", "可能是Flash硬件故障或SPI通信问题");
                    }
                }
                else
                {
                    LOG_ERROR("MAIN", "底层Flash读取失败: %d", w25q_status);
                }
            }
            else
            {
                LOG_ERROR("MAIN", "底层Flash写入失败: %d", w25q_status);
            }
        }
        else
        {
            LOG_ERROR("MAIN", "底层Flash擦除失败: %d", w25q_status);
        }
    }
    Delay_ms(1000);
    
    /* ========== 步骤15：执行所有测试 ========== */
    run_all_flash12_tests();
    
    /* ========== 步骤16：显示初始化完成 ========== */
    OLED_Clear();
    OLED_ShowString(1, 1, "Flash12");
    
    OLED_ShowString(2, 1, "All Tests Done");
    OLED_ShowString(3, 1, "LittleFS Ready");
    LOG_INFO("MAIN", "=== 所有测试完成，进入主循环 ===");
    Delay_ms(1000);
    
    /* ========== 步骤17：主循环 ========== */
    while (1)
    {
        loop_count++;
        LED_Toggle(LED_1);
        
        /* 每10次循环（约5秒）更新一次OLED显示 */
        if (loop_count % 10 == 0) {
            char buf[17];
            snprintf(buf, sizeof(buf), "Running:%lu", (unsigned long)loop_count);
            OLED_ShowString(4, 1, buf);
            LOG_INFO("MAIN", "主循环运行中... (循环 %lu)", (unsigned long)loop_count);
        }
        
        Delay_ms(500);
    }
}
